# SolidOptions Constructor

---
C#Visual BasicVisual C++
Revit 2024 API
---
SolidOptions Constructor
SolidOptions Class See Also
---
Creates a new SolidOptions class with material and graphics style settings.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2015
# Syntax
C#
---
```text
public SolidOptions(
	ElementId materialId,
	ElementId graphicsStyleId
)
```

Visual Basic
---
```text
Public Sub New ( _
	materialId As ElementId, _
	graphicsStyleId As ElementId _
)
```

Visual C++
---
```text
public:
SolidOptions(
	ElementId^ materialId,
	ElementId^ graphicsStyleId
)
```

# ### Parameters
materialId
    Type: Autodesk.Revit.DB..::..ElementId The material id for the Solid.
graphicsStyleId
    Type: Autodesk.Revit.DB..::..ElementId The graphics style id for the Solid.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
SolidOptions Class
Autodesk.Revit.DB Namespace